judasgutenberg/Esp8266_RemoteControl/firmware/esp8266/commandhandlers.h
 
#include "config.h"
#include "globals.h"
#include "i2cslave.h"
#include "utilities.h"
#include "slaveupdate.h"
#include "rootfunctions.h"


#include <Arduino.h>
#include <WiFiUdp.h>
#include <NTPClient.h>
#include <ESP8266WebServer.h>
#include <Adafruit_ADT7410.h>
#include <DHT.h>
#include <Adafruit_AHTX0.h>
#include <SFE_BMP180.h>
#include "Zanshin_BME680.h"  // Include the BME680 Sensor library
#include <Adafruit_BMP085.h>
#include <Temperature_LM75_Derived.h>
#include <Adafruit_BMP280.h>
#include <IRremoteESP8266.h>
#include <IRsend.h>
#include <Adafruit_INA219.h>
#include <Adafruit_VL53L0X.h>
#include <Adafruit_FRAM_I2C.h>
#include "SimpleMap.h" // assuming you have this header

#include <tuple>
#include <cmath> 
#include <math.h> // for isnan, NAN

#include <LittleFS.h>


void cmdDel(String* param, int argCount);
void cmdDownload(String* param, int argCount);
void cmdUpload(String* param, int argCount);
void cmdCat(String* param, int argCount);
void cmdReadSlaveEeprom(String* param, int argCount);
void cmdResetSerial(String* param, int argCount);
void cmdConfigEeprom(String* param, int argCount);
void cmdDumpSlaveEeprom(String* param, int argCount);
void cmdSendSlaveSerial(String* param, int argCount);
void cmdSetSlaveTime(String* param, int argCount);
void cmdGetSlaveTime(String* param, int argCount);
void cmdInitSlaveSerial(String* param, int argCount);
void getSlaveSerial(String* param, int argCount);
void getSlaveParsedDatum(String* param, int argCount);
void updateSlaveFirmware(String* param, int argCount);
void getMasterEepromUsed(String* param, int argCount);
void getSlaveEepromUsed(String* param, int argCount);
void getSlave(String* param, int argCount);
void setSlaveParserBasis(String* param, int argCount);
void setSlaveBasis(String* param, int argCount);
void setSlave(String* param, int argCount);
void runSlave(String* param, int argCount);
void cmdSet(String* param, int argCount);
void cmdGet(String* param, int argCount);















